
const newsList = [
  {
    title: "Новый этап в жизни Corundium’a!",
    date: "02-06-2025",
    shortText: "Недавно мы объявили о поиске энтузиастов в команду — и сегодня у нас крутые новости: мы нашли именно тех, кого искали!",
    text: `Привет, друзья!<br>
    Недавно мы объявили о поиске энтузиастов в команду — и сегодня у нас крутые новости: мы нашли именно тех, кого искали! 💡
    После участия в рубрике #ИндиСуббота, к нам пришло множество откликов. Мы провели множество собеседований и в итоге — наша команда выросла вдвое.<br>
    Но набор еще открыт!<br>
    🔥 С ростом команды вырос и масштаб задач.<br>
    Сейчас мы активно вводим новичков в проект, делимся опытом, настраиваем процессы и учимся друг у друга. Для многих это первый шаг в геймдев, и мы сделаем всё, чтобы он стал для них комфортным.<br>
    Это не просто расширение — это качественный скачок.<br>
    Мы ставим перед собой более амбициозные цели и уже готовим новый контент, которым скоро начнём делиться. Будет интересно, обещаем 😉<br>
    А пока — давайте вместе поприветствуем наших новичков в комментариях. Им точно не помешает ваша поддержка ❤️`
  },
  {
    title: "Возобновление работы Corundium’a!",
    date: "22-05-2025",
    shortText: "Мы официально возобновляем разработку Corundium’a!",
    text: `У нас отличные новости:<br>
    После месяцев тихой, но усердной работы мы официально возобновляем разработку Corundium’a! 🎉<br>
    Проект на стадии прототипирования и с каждым днём становится всё интереснее. В этот раз мы подошли к делу основательно: документация, геймдизайн — всё по-взрослому.<br>
    ⚠️ Но одно ясно точно — объём работы серьёзный.
    Мы хотим расширить команду и в первую очередь ищем помощь среди вас, нашего комьюнити 💙<br>
    Если ты:<br>
    🎨 2D/3D Artist<br>
    🛠 Unity Developer<br>
    📚 Content Manager<br>
    ...или знаешь кого-то подходящего — напиши сюда.
    Уровень навыков — не критично. Главное — желание делать круто и развиваться вместе. Остальному научимся ✊<br>
    💬 Совсем скоро будет больше новостей. Следите за обновлениями  !`
  },
  {
    title: "Ускоренная разработка Corundium’a",
    date: "15-05-2025",
    shortText: "У нас появилось больше сил и времени, мы будем работать ещё усерднее!",
    text: `У нас отличные новости:<br>
    Несмотря на жару и занятость смежными проектами, наша команда не прекращала работу над Corondium’oм. А теперь, когда у нас появилось больше сил и времени, мы будем работать ещё усерднее!<br><br>
    А пока, хотим поделиться тем, что уже готово ✅<br>
    ▫️ Закончена работа над инвентарём<br>
    ▫️ Разработана гибкая система предметов<br>
        ▫️ Улучшена система здоровья<br>
    ▫️ Улучшен ИИ врага<br>
    ▫️ Добавлена механика плавания в лодке<br><br>
    В текущий момент в разработке находятся 🛠<br>
    ▫️ Физика объектов<br>
    ▫️ Шейдеры и графика<br>
    ▫️ Механики инструментов<br>
    ▫️ Добыча ресурсов<br>
    ▫️ Сюжет, лор мира, игровые локации и персонажи<br><br>
    В нашем телеграмм канале так же будем делиться с вами:<br>
    - Процессом разработки<br>
    - Дизайнерскими концептами<br>
    - 3D моделями<br>
    - Демонстрациями геймплейных механик<br>
    - Повествованием сюжета 🤯<br><br>
    Следите за каналом, делитесь постами с друзьями, чтобы не пропустить важные новости игры и интересный контент!`
  }
];
